ezois_ka/oooezoiskaobmen/src/Catalogs/РегистрацииВНалоговомОргане/РегистрацииВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрацииВНалоговомОргане</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Доверенность</name>
    <comment>Доверенность налогоплательщика на представителя</comment>
    <type>
      <types>CatalogRef.ДоверенностиНалогоплательщика</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
      <types>CatalogRef.МашиночитаемыеДоверенности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПредставителя</name>
    <comment>Название документа, подтверждающего полномочия представителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>Код причины постановки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <comment>Представитель в территориальном органе ФНС</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченноеЛицоПредставителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаУчет</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияСУчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <comment>Филиал / ГО</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КрупнейшийНалогоплательщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <comment>Доверенность налогоплательщика на представителя</comment>
      <type>
        <types>CatalogRef.ДоверенностиНалогоплательщика</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
        <types>CatalogRef.МашиночитаемыеДоверенности</types>
      </type>
    </attributes>
    <attributes>
      <name>Представитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УполномоченноеЛицоПредставителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставителя</name>
      <comment>Название документа, подтверждающего полномочия представителя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <comment>Наименование в латинской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТранскрипции</name>
    <comment>Наименование в русской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СокращенноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/CommonModules/ЭлектронноеВзаимодействиеУТ/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеФункциональныхОпций
Процедура ПолучитьСоответствиеФункциональныхОпций(СоответствиеФО) Экспорт
	
	// Электронные документы
	СоответствиеФО.Вставить("ИспользоватьОбменЭДМеждуОрганизациями",  "ИспользоватьОбменЭДМеждуОрганизациями");
	СоответствиеФО.Вставить("ИспользоватьОбменЭД",                    "ИспользоватьОбменЭД");
	СоответствиеФО.Вставить("ИспользоватьЭлектронныеПодписи", 		  "ИспользоватьЭлектронныеПодписи");
	СоответствиеФО.Вставить("ИспользоватьОбменСБанками",              "ИспользоватьОбменСБанками");
	СоответствиеФО.Вставить("ИспользоватьОнлайнОплаты",    "ИспользоватьОнлайнОплаты");
	// Конец электронные документы
	
	СоответствиеФО.Вставить("ИспользоватьРучныеСкидкиВПродажах", 	 	"ИспользоватьРучныеСкидкиВПродажах");
	СоответствиеФО.Вставить("ИспользоватьАвтоматическиеСкидкиВПродажах", "ИспользоватьАвтоматическиеСкидкиВПродажах");
	СоответствиеФО.Вставить("ИспользоватьРучныеСкидкиВЗакупках", 		"ИспользоватьРучныеСкидкиВЗакупках");
	СоответствиеФО.Вставить("ИспользоватьПартнеровИКонтрагентов", 		"ИспользоватьПартнеровИКонтрагентов");
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеСправочников.
Процедура ПолучитьСоответствиеСправочников(СоответствиеСправочников) Экспорт
	
	СоответствиеСправочников.Вставить("Организации",                 "Организации");
	СоответствиеСправочников.Вставить("Контрагенты",                 "Контрагенты");
	СоответствиеСправочников.Вставить("Партнеры",                    "Партнеры");
	СоответствиеСправочников.Вставить("Номенклатура",                "Номенклатура");
	СоответствиеСправочников.Вставить("ХарактеристикиНоменклатуры",  "ХарактеристикиНоменклатуры");
	СоответствиеСправочников.Вставить("ЕдиницыИзмерения",            "УпаковкиЕдиницыИзмерения");
	СоответствиеСправочников.Вставить("Валюты",                      "Валюты");
	СоответствиеСправочников.Вставить("Банки",                       "КлассификаторБанков");
	СоответствиеСправочников.Вставить("УпаковкиНоменклатуры",        "УпаковкиЕдиницыИзмерения");
	СоответствиеСправочников.Вставить("БанковскиеСчетаОрганизаций",  "БанковскиеСчетаОрганизаций");
	СоответствиеСправочников.Вставить("БанковскиеСчетаКонтрагентов", "БанковскиеСчетаКонтрагентов");
	СоответствиеСправочников.Вставить("ДоговорыКонтрагентов",        "ДоговорыКонтрагентов");
	
	СоответствиеСправочников.Вставить("ФизическиеЛица",              "ФизическиеЛица"); //* Торговые предложения.
	СоответствиеСправочников.Вставить("ГосударственныеКонтрактыЕИС", "ГосударственныеКонтракты");
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеНаименованийОбъектовМДИРеквизитов
Процедура ПолучитьСоответствиеНаименованийОбъектовМДИРеквизитов(СоответствиеРеквизитовОбъекта) Экспорт
	
	// Обмен с банками начало
	СоответствиеРеквизитовОбъекта.Вставить("ПлатежноеПоручениеВМетаданных", 		"СписаниеБезналичныхДенежныхСредств");
	СоответствиеРеквизитовОбъекта.Вставить("ПлатежноеТребованиеВМетаданных", 		"ПоступлениеБезналичныхДенежныхСредств");
	СоответствиеРеквизитовОбъекта.Вставить("СокращенноеНаименованиеОрганизации",   	"Наименование");
    СоответствиеРеквизитовОбъекта.Вставить("БанковскийСчетОрганизации",				"БанковскийСчет");
	
	СоответствиеРеквизитовОбъекта.Вставить("ПлатежноеПоручение.СчетОрганизации", 	"БанковскийСчет");
	СоответствиеРеквизитовОбъекта.Вставить("ПлатежноеПоручение.Организация",     	"Организация");
    СоответствиеРеквизитовОбъекта.Вставить("БанковскийСчетОрганизации.НомерСчета",  "НомерСчета");
	СоответствиеРеквизитовОбъекта.Вставить("БанковскийСчетОрганизации.Банк",        "Банк");
	СоответствиеРеквизитовОбъекта.Вставить("БанковскийСчетОрганизации.Организация", "Владелец");
	СоответствиеРеквизитовОбъекта.Вставить("Банк.БИК",                              "Код");
	СоответствиеРеквизитовОбъекта.Вставить("Банк.Наименование",                     "Наименование");
	СоответствиеРеквизитовОбъекта.Вставить("Банк.Город",                            "Город");
	// Обмен с банками конец
	
	// Обмен с контрагентами начало
	СоответствиеРеквизитовОбъекта.Вставить("РеализацияТоваровУслугВМетаданных", 	"РеализацияТоваровУслуг");
	СоответствиеРеквизитовОбъекта.Вставить("ПриобретениеТоваровУслугВМетаданных", 	"ПриобретениеТоваровУслуг");
	СоответствиеРеквизитовОбъекта.Вставить("КоммерческоеПредложениеКлиенту",       	"КоммерческоеПредложениеКлиенту");
	СоответствиеРеквизитовОбъекта.Вставить("РегистрацияЦенНоменклатурыПоставщика", 	"РегистрацияЦенНоменклатурыПоставщика");
	СоответствиеРеквизитовОбъекта.Вставить("ДатаВыставленияВСчетеФактуреВыданном", 	"ДатаВыставления");
	СоответствиеРеквизитовОбъекта.Вставить("ДатаПолученияВСчетеФактуреПолученном", 	"Дата");
	СоответствиеРеквизитовОбъекта.Вставить("ИННКонтрагента",                       	"ИНН");
	СоответствиеРеквизитовОбъекта.Вставить("КППКонтрагента",                       	"КПП");
	СоответствиеРеквизитовОбъекта.Вставить("НаименованиеКонтрагента",              	"Наименование");
	СоответствиеРеквизитовОбъекта.Вставить("НаименованиеКонтрагентаДляСообщенияПользователю", "Наименование");
	СоответствиеРеквизитовОбъекта.Вставить("ВнешнийКодКонтрагента",                	"ИНН");
	СоответствиеРеквизитовОбъекта.Вставить("ПартнерКонтрагента",                   	"Партнер");
	СоответствиеРеквизитовОбъекта.Вставить("ИННОрганизации",                       	"ИНН");
	СоответствиеРеквизитовОбъекта.Вставить("КППОрганизации",                       	"КПП");
	СоответствиеРеквизитовОбъекта.Вставить("ОГРНОрганизации",                      	"ОГРН");
	СоответствиеРеквизитовОбъекта.Вставить("ПолноеНаименованиеОрганизации",         "НаименованиеПолное");
	СоответствиеРеквизитовОбъекта.Вставить("НаименованиеОрганизации",              	"Наименование");
	СоответствиеРеквизитовОбъекта.Вставить("ЮридическоеФизическоеЛицо",             "ЮрФизЛицо");
	
	СоответствиеРеквизитовОбъекта.Вставить("НомерДоговораКонтрагента",             	"Номер");
	СоответствиеРеквизитовОбъекта.Вставить("ДатаДоговораКонтрагента",              	"Дата");
	СоответствиеРеквизитовОбъекта.Вставить("ВладелецДоговораКонтрагента",           "Контрагент");
	// Обмен с контрагентами конец
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект
Процедура НайтиСсылкуНаОбъект(ТипОбъекта, Результат, ИдОбъекта = "", ДополнительныеРеквизиты = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Неопределено;

	//++ Локализация

	Если ТипОбъекта = "Валюты" ИЛИ ТипОбъекта = "ЕдиницыИзмерения" Тогда
		Если ТипОбъекта = "ЕдиницыИзмерения" Тогда
			ТипОбъекта = "УпаковкиЕдиницыИзмерения";
		КонецЕсли;
		Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "Код", ИдОбъекта);   
	ИначеЕсли ТипОбъекта = "Банки" Тогда
		Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту("КлассификаторБанков", "Код", ИдОбъекта);   
		
	ИначеЕсли ТипОбъекта = "Партнеры" И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		Контрагент = Неопределено;
		Если ДополнительныеРеквизиты.Свойство("Контрагент", Контрагент) И ЗначениеЗаполнено(Контрагент) Тогда
			Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер");
		КонецЕсли;
	ИначеЕсли (ТипОбъекта = "Контрагенты" ИЛИ ТипОбъекта = "Организации") И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		ПараметрПоиска = "";
		ИНН = Неопределено;
		ДополнительныеРеквизиты.Свойство("ИНН", ИНН);
		Если ИНН = Неопределено Тогда
			ИНН = "";
		КонецЕсли;
		КПП = Неопределено;
		ДополнительныеРеквизиты.Свойство("КПП", КПП);
		Если КПП = Неопределено Тогда
			КПП = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(ИНН + КПП) Тогда // по ИНН + КПП
			ОбменСКонтрагентамиПереопределяемый.СсылкаНаОбъектПоИННКПП(ТипОбъекта, ИНН, КПП, Результат); 
		КонецЕсли;
		
		ИмяМетаданных = ОбменСКонтрагентамиУТ.ИмяПрикладногоСправочника(ТипОбъекта);
		
		Если НЕ ЗначениеЗаполнено(Результат) И ДополнительныеРеквизиты.Свойство("Наименование", ПараметрПоиска) Тогда // по Наименованию
			Если ТипОбъекта = "Организации" Тогда
				Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту(ИмяМетаданных, "НаименованиеСокращенное", ПараметрПоиска);
			Иначе
				Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту(ИмяМетаданных, "Наименование", ПараметрПоиска);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипОбъекта = "НоменклатураПоставщиков" И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		Владелец = "";
		ПараметрПоиска = "";
		Если Не ДополнительныеРеквизиты.Свойство("Владелец", Владелец) Тогда 
			Владелец = Неопределено;
		КонецЕсли;		
		Если ДополнительныеРеквизиты.Свойство("Идентификатор", ПараметрПоиска) Тогда // по Идентификатору и Владельцу
			Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "Идентификатор", ПараметрПоиска, Владелец);
		ИначеЕсли ДополнительныеРеквизиты.Свойство("Ид", ПараметрПоиска) Тогда
			Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "Идентификатор", ПараметрПоиска, Владелец);
		КонецЕсли;
	ИначеЕсли ТипОбъекта = "Номенклатура" И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		ПараметрПоиска = "";
		Если ДополнительныеРеквизиты.Свойство("Идентификатор", ПараметрПоиска) Тогда // по Идентификатору
			Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаНоменклатуруПоИдентификаторуНоменклатурыПоставщика(ПараметрПоиска);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Результат) И ДополнительныеРеквизиты.Свойство("НоменклатураПартнера", ПараметрПоиска) Тогда // по НоменклатуреПоставщика
			Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаНоменклатуруПоНоменклатуреПоставщика(ПараметрПоиска);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Результат) И ДополнительныеРеквизиты.Свойство("Артикул", ПараметрПоиска) Тогда // по Коду номенклатуры своей компании
			Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "Код", ПараметрПоиска);
		КонецЕсли;
	ИначеЕсли (ТипОбъекта = "БанковскиеСчетаОрганизаций" ИЛИ ТипОбъекта = "БанковскиеСчетаКонтрагентов") И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		ПараметрПоиска 	= "";
		Владелец 		= "";
		Если ДополнительныеРеквизиты.Свойство("НомерСчета", ПараметрПоиска) Тогда // по Номеру счета
			Если ДополнительныеРеквизиты.Свойство("Владелец", Владелец) И ТипЗнч(Владелец) <> Тип("Строка") Тогда
				Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "НомерСчета", ПараметрПоиска, Владелец);
			Иначе
				Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "НомерСчета", ПараметрПоиска); 
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВРег(ТипОбъекта) = ВРег("ДоговорыКонтрагентов") Тогда		
		Результат = ОбменСКонтрагентамиУТ.ДоговорКонтрагентаПоРеквизитам(ДополнительныеРеквизиты);		
	ИначеЕсли ТипОбъекта = "ВидыКонтактнойИнформации" Тогда
		Если ИдОбъекта = "ФаксКонтрагента" Тогда
			Результат = Неопределено;
		Иначе
			Результат = Справочники[ТипОбъекта][ИдОбъекта];
		КонецЕсли;
	ИначеЕсли ТипОбъекта = "СтраныМира" Тогда	
		Результат = ОбменСКонтрагентамиУТ.НайтиСсылкуНаОбъектПоРеквизиту("СтраныМира", "Код", ИдОбъекта);
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(ИдОбъекта);
		КонецЕсли;
	КонецЕсли;

	//-- Локализация
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПроверитьГотовностьИсточников
Процедура ПроверитьГотовностьИсточников(ДокументыМассив, БезЭлектроннойПодписи = Ложь) Экспорт

	//++ Локализация
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияТипаИзМассива(ДокументыМассив, Тип("СтрокаГруппировкиДинамическогоСписка"));
	
	// Удалим из массива документы, которые не могут быть выставлены в электронном виде.
	ДокументыБезУказанияКонтрагента = Новый Массив();
	Для каждого Документ Из ДокументыМассив Цикл
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
			Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Контрагент");
			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				ДокументыБезУказанияКонтрагента.Добавить(Документ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Перед формированием ЭД документы ИБ должны быть проведены
	ДокументыПодлежащиеПроведению = Новый Массив;
	Для каждого Элемент Из ДокументыМассив Цикл
				
		ЭтоЗаказ = ТипЗнч(Элемент) = Тип("ДокументСсылка.ЗаказПоставщику") 
				Или ТипЗнч(Элемент) = Тип("ДокументСсылка.ЗаказКлиента");
			
		// Не проверяем проведение документов заказ поставщику при отправке через 1С:Бизнес-сеть
		Если БезЭлектроннойПодписи И ЭтоЗаказ Тогда
			Продолжить;
		КонецЕсли;
		
		МетаданныеДокумента = Элемент.Метаданные();
		Если ОбщегоНазначения.ЭтоДокумент(МетаданныеДокумента)
			 И МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			ДокументыПодлежащиеПроведению.Добавить(Элемент);
		КонецЕсли;		
	КонецЦикла;
	
	Если ДокументыПодлежащиеПроведению.Количество() = 0 Тогда
		// Проверку выполнять не требуется
		Возврат;
	КонецЕсли;
	
	МассивНепроведенныхДокументов = ОбщегоНазначения.ПроверитьПроведенностьДокументов(ДокументыПодлежащиеПроведению);
	КоличествоНепроведенныхДокументов = МассивНепроведенныхДокументов.Количество();
	
	Если КоличествоНепроведенныхДокументов <> 0 Тогда	
		Если КоличествоНепроведенныхДокументов = 1 Тогда
			Текст = НСтр("ru = 'Для того чтобы сформировать электронную версию документа, его необходимо предварительно провести.'");
		Иначе
			Текст = НСтр("ru = 'Для того чтобы сформировать электронные версии документов, их необходимо предварительно провести.'");
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
		ОбменСКонтрагентамиУТ.УдалитьДокументыНеподходящиеДляФормированияЭД(
			ДокументыМассив,
			МассивНепроведенныхДокументов,
			НСтр("ru = 'Документ %1 не проведен.'"));
	КонецЕсли;
		
	Если ДокументыБезУказанияКонтрагента.Количество() Тогда
		ШаблонСообщения = Нстр("ru = 'Не заполнен Контрагент в Соглашении документа %1'");
		ОбменСКонтрагентамиУТ.УдалитьДокументыНеподходящиеДляФормированияЭД(
			ДокументыМассив,
			ДокументыБезУказанияКонтрагента,
			ШаблонСообщения);
	КонецЕсли;
	
	ИнтеграцияИСВызовСервераУТ.ДокументыСОшибкамиПроверкиЗаполненияКодовМаркировки(ДокументыМассив, Ложь);
	
	//-- Локализация
	
КонецПроцедуры

// Получает данные о физическом (юридическом) лице по ссылке.
//
// Параметры:
//  ЮрФизЛицо - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - ссылка на элемент справочника, по которому надо получить данные.
//  БанковскийСчет - СправочникСсылка.БанковскиеСчетаОрганизаций, СправочникСсылка.БанковскиеСчетаКонтрагентов - ссылка на банковский счет.
//  ДатаСведений - Дата - дата на которую надо получить данные.
//
// Возвращаемое значение:
// 	Структура:
// 		* СтранаРегистрации - СправочникСсылка.СтраныМира
// 		* Ссылка - СправочникСсылка.РегистрацииВНалоговомОргане,СправочникСсылка.Организации,СправочникСсылка.Контрагенты
// 		* Наименование - Строка
// 		* Фамилия - Строка
// 		* Имя - Строка
// 		* Отчество - Строка
//
Функция ПолучитьДанныеЮрФизЛица(ЮрФизЛицо, Знач БанковскийСчет = Неопределено, ДатаСведений = Неопределено) Экспорт
	
	Сведения = Новый Структура;
	//++ Локализация
	
	Сведения = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	Сведения.Вставить("СтранаРегистрации");
	Сведения.Вставить("Свидетельство");

	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат Сведения;
	КонецЕсли;

	Сведения.Ссылка = ЮрФизЛицо;

	УстановитьПривилегированныйРежим(Истина);
	Если ДатаСведений = Неопределено Тогда
		ДатаСведений = ТекущаяДатаСеанса();
	КонецЕсли;

	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.РегистрацииВНалоговомОргане") Тогда
		ДанныеЮрФизЛица = Справочники.РегистрацииВНалоговомОргане.СведенияОПодразделении(ЮрФизЛицо, ДатаСведений);
		ДанныеЮрФизЛица.Вставить("ЮрФизЛицо", Перечисления.ЮрФизЛицо.ЮрЛицо);
		ДанныеЮрФизЛица.Вставить("Телефоны", "");
		ДанныеЮрФизЛица.Вставить("СокращенноеНаименование", ДанныеЮрФизЛица.ПолноеНаименование);
	Иначе
		ДанныеЮрФизЛица = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ЮрФизЛицо, ДатаСведений,, БанковскийСчет);
		Если ТипЗнч(ДанныеЮрФизЛица.Банк) = Тип("СправочникСсылка.КлассификаторБанков") Тогда
			ДанныеЮрФизЛица.Банк = ДанныеЮрФизЛица.Банк.Наименование;
		КонецЕсли;
		Если Не ДанныеЮрФизЛица.Свойство("СтранаРегистрации") Тогда
			ДанныеЮрФизЛица.Вставить("СтранаРегистрации", Справочники.СтраныМира.Россия);
		КонецЕсли;
		Если ДанныеЮрФизЛица.Свойство("КПП")
			И Не ЗначениеЗаполнено(ДанныеЮрФизЛица.КПП)
			И ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			ДанныеЮрФизЛица.КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "КПП")
		КонецЕсли;
		Если ДанныеЮрФизЛица.Свойство("ОГРН")
			И ЗначениеЗаполнено(ДанныеЮрФизЛица.ОГРН)
			И ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			ДанныеЮрФизЛица.Вставить("ДатаОГРН", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "ДатаРегистрации"))
		КонецЕсли;
	КонецЕсли;
	Если Не ДанныеЮрФизЛица.Свойство("Наименование") Тогда
		ДанныеЮрФизЛица.Вставить("Наименование", ДанныеЮрФизЛица.ПолноеНаименование);
	КонецЕсли;
	
	// Поддержка цифрового рубля
	Сведения.Вставить("ЦифровойСчет", Ложь);
	Сведения.Вставить("ИдентификаторСчетаЦифровогоРубля");
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		ДанныеЮрФизЛица.Вставить("ЦифровойСчет", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "СчетЦифровогоРубля"));
		ДанныеЮрФизЛица.Вставить("ИдентификаторСчетаЦифровогоРубля", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "ИдентификаторСчетаЦифровогоРубля"));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Сведения, ДанныеЮрФизЛица);
	
	Если Сведения.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель
		Или Сведения.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда

		ПолноеНаименование = Сведения.ОфициальноеНаименование;

		ВариантыОФ = Новый Массив;
		ВариантыОФ.Добавить(НСтр("ru = 'ИП ГКФХ'"));
		ВариантыОФ.Добавить(НСтр("ru = 'ИП Глава КФХ'"));
		ВариантыОФ.Добавить(НСтр("ru = 'ГКФХ'"));
		ВариантыОФ.Добавить(НСтр("ru = 'Глава КФХ'"));
		ВариантыОФ.Добавить(НСтр("ru = 'Индивидуальный предприниматель Глава крестьянского фермерского хозяйства'"));
		ВариантыОФ.Добавить(НСтр("ru = 'ИП Глава крестьянского фермерского хозяйства'"));
		ВариантыОФ.Добавить(НСтр("ru = 'Глава крестьянского фермерского хозяйства'"));
		ВариантыОФ.Добавить(НСтр("ru = 'ИП Глава крестьянского (фермерского) хозяйства'"));
		ВариантыОФ.Добавить(НСтр("ru = 'Индивидуальный предприниматель Глава крестьянского (фермерского) хозяйства'"));
		ВариантыОФ.Добавить(НСтр("ru = 'ИП'"));
		ВариантыОФ.Добавить(НСтр("ru = 'Индивидуальный предприниматель'"));
		
		Для Каждого Вариант Из ВариантыОФ Цикл
			Если Вариант <> "ИП" Тогда
				РезультатПоиска = СтрНайти(ВРег(ПолноеНаименование), ВРег(Вариант));
			Иначе
				РезультатПоиска = СтрНайти(ПолноеНаименование, Вариант);
			КонецЕсли;
			Если РезультатПоиска Тогда
				Если РезультатПоиска = 1 Тогда
					ПолноеНаименование = СокрЛП(Прав(ПолноеНаименование, СтрДлина(ПолноеНаименование) - СтрДлина(Вариант)));
				Иначе
					ПолноеНаименование = СокрЛП(Лев(ПолноеНаименование, СтрДлина(ПолноеНаименование) - СтрДлина(Вариант)));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ПолноеНаименование);
		ЗаполнитьЗначенияСвойств(Сведения, ФИО);

	КонецЕсли;

	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицо,, ДатаСведений, Ложь);

	Для Каждого СтрокаТаблицыКИ Из ТаблицаКИ Цикл

		Если СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда

			Сведения.ЮридическийАдресXML = СтрокаТаблицыКИ.ЗначенияПолей;
			Сведения.ЮридическийАдрес = СтрокаТаблицыКИ.Представление;

		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда

			Сведения.ФактическийАдресXML = СтрокаТаблицыКИ.ЗначенияПолей;
			Сведения.ФактическийАдрес = СтрокаТаблицыКИ.Представление;

		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента Тогда

			Сведения.ПочтовыйАдресXML = СтрокаТаблицыКИ.ЗначенияПолей;
			Сведения.ПочтовыйАдрес = СтрокаТаблицыКИ.Представление;

		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда

			Сведения.ТелефоныXML = СтрокаТаблицыКИ.ЗначенияПолей;
			Сведения.Телефоны = СтрокаТаблицыКИ.Представление;

		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента Тогда

			Сведения.ЭлектроннаяПочта = СтрокаТаблицыКИ.Представление;

		КонецЕсли;

	КонецЦикла;

	Если Сведения.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
		Сведения.ИНННерезидента = ДанныеЮрФизЛица.ИНН;
		
		Если ЗначениеЗаполнено(Сведения.ЮридическийАдресXML) Тогда
			СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(Сведения.ЮридическийАдресXML);
			Сведения.КодСтраныНерезидента = СведенияОбАдресе.КодСтраны;
		ИначеЕсли ЗначениеЗаполнено(Сведения.ФактическийАдресXML) Тогда
			СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(Сведения.ФактическийАдресXML);
			Сведения.КодСтраныНерезидента = СведенияОбАдресе.КодСтраны;
		КонецЕсли;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

	//-- Локализация

	Возврат Сведения;

КонецФункции

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПередЗаписьюВладельцаЭлектронногоДокумента
Процедура ПередЗаписьюВладельцаЭлектронногоДокумента(Объект, ИзменилисьКлючевыеРеквизиты, Знач СостояниеЭлектронногоДокумента, 
	ПодлежитОбменуЭД, ТребуетсяКонтрольАктуальности, Отказ) Экспорт

	//++ Локализация
	
	//++ НЕ УТ

	// БЗКР
	Если Метаданные.ОпределяемыеТипы.ВладелецОбъектОбменСБанкамиБЗК.Тип.СодержитТип(ТипЗнч(Объект)) Тогда
		ЭлектронноеВзаимодействиеБЗК.ПередЗаписьюВладельцаЭлектронногоДокумента(Объект, ИзменилисьКлючевыеРеквизиты, СостояниеЭлектронногоДокумента, ПодлежитОбменуЭД, Отказ);
		Возврат;
	КонецЕсли;
	// Конец БЗКР

	//-- НЕ УТ
	
	Если ЭтоЭлектронныеПеревозочныеДокументы(Объект) Тогда
		Возврат;
	КонецЕсли;

	ЭлектронныйДокументСформирован = ЭлектронныйДокументСформирован(Объект, СостояниеЭлектронногоДокумента);	
	ПодлежитОбменуЭД = ОбменСКонтрагентамиУТ.ПодлежитОбменуЭД(Объект, ЭлектронныйДокументСформирован);

	// Если документ не подлежит обмену, то проверять изменение ключевых реквизитов не требуется.	
	Если ПодлежитОбменуЭД Тогда
		ИмяОбъекта = Объект.Метаданные().ПолноеИмя();	
		ТаблицаРеквизитовРегистрации = ОбменСКонтрагентамиУТ.КлючевыеРеквизитыОбъекта(ИмяОбъекта);
		Если Не ТаблицаРеквизитовРегистрации.Количество() Тогда
			ИзменилисьКлючевыеРеквизиты = Истина;
		КонецЕсли;
		
		Для каждого СтрокаТаблицыРеквизитовРегистрации Из ТаблицаРеквизитовРегистрации Цикл
			ЕстьИзмененияВерсийОбъектов =
				ОбменСКонтрагентамиУТ.ОпределитьИзмененияВерсийОбъекта(Объект, СтрокаТаблицыРеквизитовРегистрации);
			Если ЕстьИзмененияВерсийОбъектов Тогда
				ИзменилисьКлючевыеРеквизиты = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПередЗаписьюВладельцаЭлектронногоДокументаЭлементСправочника.
Процедура ПередЗаписьюВладельцаЭлектронногоДокументаЭлементСправочника(Объект, ИзменилисьКлючевыеРеквизиты,
	Знач СостояниеЭлектронногоДокумента, ПодлежитОбменуЭД, ТребуетсяКонтрольАктуальности, Отказ) Экспорт
	
	//++ Локализация
		
	Если Объект.ДополнительныеСвойства.Свойство("ИзменилисьКлючевыеРеквизиты")
		И Объект.ДополнительныеСвойства.ИзменилисьКлючевыеРеквизиты Тогда
		ИзменилисьКлючевыеРеквизиты = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяОбъекта = Объект.Метаданные().ПолноеИмя();
	
	ТаблицаРеквизитовРегистрации = ОбменСКонтрагентамиУТ.КлючевыеРеквизитыОбъекта(ИмяОбъекта);
	Если Не ТаблицаРеквизитовРегистрации.Количество() Тогда
		ИзменилисьКлючевыеРеквизиты = Истина;
	КонецЕсли;
	
	 Для каждого СтрокаТаблицыРеквизитовРегистрации Из ТаблицаРеквизитовРегистрации Цикл
		ЕстьИзмененияВерсийОбъектов =
			ОбменСКонтрагентамиУТ.ОпределитьИзмененияВерсийОбъекта(Объект, СтрокаТаблицыРеквизитовРегистрации);
		Если ЕстьИзмененияВерсийОбъектов Тогда
			ИзменилисьКлючевыеРеквизиты = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ИзменилисьКлючевыеРеквизиты И ИмяОбъекта = "Справочник.ДоговорыКонтрагентов" Тогда
		СсылкаФайлЭД = ПолучитьДанныеОтправленногоФайлаДоговорногоДокумента(Объект); 
		Если ЗначениеЗаполнено(СсылкаФайлЭД) Тогда
			ОбменСКонтрагентамиУТ.ОбновитьСостояниеОтправленногоФайлаДоговорногоДокумента(СсылкаФайлЭД, Ложь);
		КонецЕсли;
	КонецЕсли;		
	
	Объект.ДополнительныеСвойства.Вставить("ИзменилисьКлючевыеРеквизиты", ИзменилисьКлючевыеРеквизиты);
	
	//-- Локализация
	
КонецПроцедуры

// Получает данные о файле Договорного документа отправленного по ЭДО.
//
// Параметры:
//  Объект - СправочникСсылка - ссылка на элемент справочника, по которому получаются данные.
// 
// Возвращаемое значение:
//  - СправочникСсылка.ДоговорыКонтрагентовПрисоединенныеФайлы
//  - Неопределено - если элемент не найден в ИБ.
//
Функция ПолучитьДанныеОтправленногоФайлаДоговорногоДокумента(Объект) Экспорт
	
	Файл = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентовПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК ДоговорыКонтрагентовПрисоединенныеФайлы
	|ГДЕ
	|	ДоговорыКонтрагентовПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И ДоговорыКонтрагентовПрисоединенныеФайлы.ОтправленПолученЭД = ИСТИНА";

	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Файл = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Файл;
	
КонецФункции

// Получает данные о физическом лице по ссылке.
//
// Параметры:
//  ФизЛицо - СправочникСсылка - ссылка на элемент справочника, по которому получаются данные.
//  Сведения - см. ЭлектронноеВзаимодействие.СтруктураДанныхФизЛица
//  ПолучатьДанныеДокумента - Булево - Истина - получать данные по документу (при наличии)
Процедура ПолучитьДанныеФизЛица(ФизЛицо, Сведения, ПолучатьДанныеДокумента = Истина) Экспорт

	//++ Локализация
	
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат
	КонецЕсли;

	ДанныеЮрФизЛица = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ФизЛицо, ТекущаяДатаСеанса());

	Если Не ДанныеЮрФизЛица.Свойство("СтранаРегистрации") Тогда
		ДанныеЮрФизЛица.Вставить("СтранаРегистрации", Справочники.СтраныМира.Россия);
	КонецЕсли;

	Реквизиты = "ДатаРождения, ИНН, Пол";

	//++ НЕ УТ
	
	Реквизиты = Реквизиты + ", СтраховойНомерПФР, ФИО, МестоРождения";

	//-- НЕ УТ
	
	СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФизЛицо, Реквизиты);
	ДанныеФИО = ФизическиеЛицаУТ.ФамилияИмяОтчество(ФизЛицо, ТекущаяДатаСеанса());
	ДанныеФИО.Вставить("ФИО", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизЛицо, "Наименование"));

	Сведения.ДатаРождения      = СтруктураДанных.ДатаРождения;
	Сведения.ИНН               = СтруктураДанных.ИНН;
	Сведения.Пол               = Строка(СтруктураДанных.Пол);
	
	Сведения.ФИО               = ДанныеФИО.ФИО;
	Сведения.Фамилия           = ДанныеФИО.Фамилия;
	Сведения.Имя               = ДанныеФИО.Имя;
	Сведения.Отчество          = ДанныеФИО.Отчество;
	
	//++ НЕ УТ
	
	Сведения.МестоРождения     = СтруктураДанных.МестоРождения;
	Сведения.СтраховойНомерПФР = СтруктураДанных.СтраховойНомерПФР;
	Сведения.ФИО               = СтруктураДанных.ФИО;

	//-- НЕ УТ
	
	Если Сведения.Свойство("Телефоны") Тогда
		
		ЗначенияКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизЛицо, 
																									Перечисления.ТипыКонтактнойИнформации.Телефон,
																									ТекущаяДатаСеанса(),
																									Ложь);
		МассивТелефонов = Новый Массив();
		Для Каждого Элемент Из ЗначенияКонтактнойИнформации Цикл
			МассивТелефонов.Добавить(Элемент.Представление);
		КонецЦикла;
		
		Сведения.Телефоны = СтрСоединить(МассивТелефонов, ", ");
		
	КонецЕсли;
	
	Если Сведения.Свойство("ЭлектроннаяПочта") Тогда
		
		ЗначенияКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизЛицо, 
																									Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
																									ТекущаяДатаСеанса(),
																									Истина);
		
		Сведения.ЭлектроннаяПочта = ЗначенияКонтактнойИнформации;
		
	КонецЕсли;
	
	Сведения.Гражданство       = ДанныеЮрФизЛица.СтранаРегистрации;
	Если ПолучатьДанныеДокумента Тогда
		ДанныеДокументаФизЛица = ФизическиеЛицаУТ.ПолучитьДокументФизическогоЛицаПоУмолчанию(ФизЛицо);
		Если ЗначениеЗаполнено(ДанныеДокументаФизЛица.ВидДокумента) Тогда
			Сведения.КодФНС = ДанныеДокументаФизЛица.КодМВД;
			Сведения.Серия  = ДанныеДокументаФизЛица.Серия;
			Сведения.Номер  = ДанныеДокументаФизЛица.Номер;
			Сведения.ДатаВыдачи = ДанныеДокументаФизЛица.ДатаВыдачи;
			Сведения.КемВыдан = ДанныеДокументаФизЛица.КемВыдан;
			Сведения.КодПодразделения = ДанныеДокументаФизЛица.КодПодразделения;
		КонецЕсли;
	КонецЕсли;

	//-- Локализация
	
КонецПроцедуры

// Получает ссылку на физическое лицо по сведениям.
// 
// Параметры:
//  СведенияФизЛица - структура:
//  	* ИНН - строка
// 
// Возвращаемое значение:
//  - СправочникСсылка.ФизическиеЛица
//  - Неопределено - если не элемент не найден в ИБ.
//
Функция ПолучитьФизЛицоМЧД(СведенияФизЛица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ФизическоеЛицо = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ИНН = &ИНН";

	Запрос.УстановитьПараметр("ИНН", СведенияФизЛица.ИНН);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ФизическоеЛицо = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ФизическоеЛицо;

КонецФункции

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДокументыФизЛица
Процедура ПолучитьДокументыФизЛица(ФизЛицо, Сведения) Экспорт

	ДанныеФизЛица = ФизическиеЛицаУТ.ПолучитьДокументФизическогоЛицаПоУмолчанию(ФизЛицо,, ТекущаяДатаСеанса());
	
	Сведения = Новый Структура;
	Сведения.Вставить("ВидДокумента"    , ДанныеФизЛица.ВидДокумента);
	Сведения.Вставить("Серия"           , ДанныеФизЛица.Серия);
	Сведения.Вставить("Номер"           , ДанныеФизЛица.Номер);
	Сведения.Вставить("ДатаВыдачи"      , ДанныеФизЛица.ДатаВыдачи);
	Сведения.Вставить("КемВыдан"        , ДанныеФизЛица.КемВыдан);
	Сведения.Вставить("КодПодразделения", ДанныеФизЛица.КодПодразделения);

КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьТипыОрганизацииПредставителяМЧД
Процедура ПолучитьТипыОрганизацииПредставителяМЧД(Типы) Экспорт

	Типы.Добавить(Тип("СправочникСсылка.Контрагенты"));
	Типы.Добавить(Тип("СправочникСсылка.Организации"));

КонецПроцедуры

// Получить ссылку на организацию-представителя МЧД.
// 
// Параметры:
//  СведенияЮрЛица - структура:
// 		* ИНН 	- строка
// 		* КПП 	- строка
// 		* ОГРН 	- строка
// 
// Возвращаемое значение:
// 	СправочникСсылка - ссылка на элемент справочника, Неопределено
//  
Функция ПолучитьОрганизациюМЧД(СведенияЮрЛица) Экспорт

	//++ Локализация

	ИскомаяОрганизация = Справочники.Организации.ПустаяСсылка();
	ОбменСКонтрагентамиУТ.СсылкаНаОбъектПоИННКПП("Организации", СведенияЮрЛица.ИНН, СведенияЮрЛица.КПП, ИскомаяОрганизация, ТекущаяДатаСеанса());
	Если ЗначениеЗаполнено(ИскомаяОрганизация) Тогда
		Возврат ИскомаяОрганизация;
	КонецЕсли;
	
	ИскомыйКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	ОбменСКонтрагентамиУТ.СсылкаНаОбъектПоИННКПП("Контрагенты", СведенияЮрЛица.ИНН, СведенияЮрЛица.КПП, ИскомыйКонтрагент);
	Если ЗначениеЗаполнено(ИскомыйКонтрагент) Тогда
		Возврат ИскомыйКонтрагент;
	КонецЕсли;
	
	//-- Локализация
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

Функция ЭтоЭлектронныеПеревозочныеДокументы(Объект)
	
	Если ОбщегоНазначения.ЭтоДокумент(Объект.Метаданные()) Тогда
		
		Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Объект) Тогда
			Ссылка = Объект;
		Иначе
			Ссылка = Объект.Ссылка;
		КонецЕсли;
		
		Возврат Метаданные.ОпределяемыеТипы.ДокументыЭПД.Тип.СодержитТип(ТипЗнч(Ссылка)); 
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;

КонецФункции

Функция ЭлектронныйДокументСформирован(Объект, СостояниеЭлектронногоДокумента)

	Если Не ЗначениеЗаполнено(СостояниеЭлектронногоДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоБанковскийДокумент(Объект) Тогда
		Возврат СостояниеЭлектронногоДокумента <> Перечисления.СостоянияОбменСБанками.НеСформирован;
	Иначе
		Возврат СостояниеЭлектронногоДокумента <> Перечисления.СостоянияДокументовЭДО.НеСформирован;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ЭтоБанковскийДокумент(Объект)

	ТипОбъекта = ТипЗнч(Объект);
	Возврат ТипОбъекта = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств");
		
КонецФункции

//-- Локализация
	
#КонецОбласти
